In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import scipy as sp
from scipy import stats
import math
import matplotlib.pyplot as plt
import warnings
warnings.filterwarnings("ignore")

EXERCISE 1. The hourly wages in a particular industry are normally distributed with mean $13.20 and standard deviation $2.50. A company in this industry employs 40 workers, paying them an average of $12.20 per hour. Can this company be accused of paying substandard wages? Use an α = .01 level test. (Wackerly, Ex.10.18)

In [5]:
M = 13.20 
sigma = 2.50
n = 40 
mu = 12.20
a = 0.01

H0 : M = 13.30

Ha : M < 13.30

In [6]:
# z_test = ( x ̅  - μ )  /  ( σ / √n ) 

z_test = (mu - M) / (sigma / np.sqrt(n))
z_test

-2.5298221281347035

In [8]:
# from z-table we found z score at the level of our alpha = 0.01 which is critical point 

Zα = -2.325

if z_test < Zα:
    print("Reject the Null")
else:
    print("Fail to reject Null")

Reject the Null

In [7]:
pvalue = stats.norm.cdf(z_test) # left side area
pvalue

0.005706018193000826

In [9]:
alpha = 0.01   # (α = 1% --> 1-99%) it is given in the question

if pvalue < alpha:
    print("Reject the Null")
else:
    print("Fail to reject")

Reject the Null

EXERCISE 2.Shear strength measurements derived from unconfined compression tests for two types of soils gave the results shown in the following document (measurements in tons per square foot). Do the soils appear to differ with respect to average shear strength, at the 1% significance level?

In [11]:
a = 0.01

In [12]:
df_soil = pd. read_excel ("soil.xlsx")
df_soil.head(10)

   Soil1  Soil2
0  1.442  1.364
1  1.943  1.878
2  1.110  1.337
3  1.912  1.828
4  1.553  1.371
5  1.641  1.428
6  1.499  1.119
7  1.347  1.373
8  1.685  1.589
9  1.578  1.714

In [13]:
df_soil.shape

(35, 2)

In [18]:
df_soil ["Soil1"].mean()

1.6918

In [19]:
df_soil ["Soil2"].mean()

1.4171142857142855

In [21]:
stats.ttest_ind(df_soil["Soil1"], df_soil["Soil2"])

Ttest_indResult(statistic=nan, pvalue=nan)

In [27]:
df_soil.isnull(). value_counts()

Soil1  Soil2
False  False    30
True   False     5
dtype: int64

In [30]:
stats.ttest_ind(df_soil["Soil1"], df_soil["Soil2"])

Ttest_indResult(statistic=nan, pvalue=nan)

In [33]:
soil1n = df_soil.Soil1[df_soil.Soil1.notnull()]
soil1n

0     1.442
1     1.943
2     1.110
3     1.912
4     1.553
5     1.641
6     1.499
7     1.347
8     1.685
9     1.578
10    1.866
11    1.653
12    1.665
13    1.640
14    1.976
15    1.754
16    1.589
17    1.976
18    1.863
19    1.932
20    1.570
21    1.613
22    2.054
23    1.550
24    1.714
25    1.896
26    1.737
27    1.740
28    1.708
29    1.548
Name: Soil1, dtype: float64

In [34]:
n1 = len (soil1n)
n2 = len (df_soil.Soil2)

In [35]:
ind_soil = stats.ttest_ind(soil1_n, df_soil.Soil2)

Ttest_indResult(statistic=5.1681473319343345, pvalue=2.593228732352821e-06)

In [41]:
t = ind_soil.statistic
df = n1 + n2 - 2

In [38]:
p_value = 2 * (1 - stats.t.cdf(t, df))
p_value

2.59322873219503e-06

In [40]:
if p_value < alpha:
    print("Reject the Null")
else:
    print("Fail to reject")

Reject the Null

EXERCISE 3. The following dataset is based on data provided by the World Bank (https://datacatalog.worldbank.org/dataset/education-statistics). World Bank Edstats.  2015 PISA Test Dataset

Get descriptive statistics (the central tendency, dispersion and shape of a dataset’s distribution) for each continent group (AS, EU, AF, NA, SA, OC).
Determine whether there is any difference (on the average) for the math scores among European (EU) and Asian (AS) countries (assume normality and equal variances). Draw side-by-side box plots.

In [44]:
dfpisa = pd.read_excel ("2015 PISA Test.xlsx")
dfpisa.head()

,Country Code,Continent_Code,internet_users_per_100,Math,Reading,Science
0,ALB,EU,63.252933,413.1570,405.2588,427.2250
1,ARE,AS,90.500000,427.4827,433.5423,436.7311
2,ARG,SA,68.043064,409.0333,425.3031,432.2262
3,AUS,OC,84.560519,493.8962,502.9006,509.9939
4,AUT,EU,83.940142,496.7423,484.8656,495.0375

In [45]:
dfpisa.describe()

       internet_users_per_100        Math     Reading     Science
count               70.000000   70.000000   70.000000   70.000000
mean                71.973099  460.971557  460.997291  465.439093
std                 16.390632   53.327205   49.502679   48.397254
min                 21.976068  327.702000  346.549000  331.638800
25%                 60.899020  417.416075  426.948625  425.923375
50%                 72.999350  477.607150  480.199850  475.400050
75%                 85.026763  500.482925  499.687475  502.431250
max                 98.200000  564.189700  535.100200  555.574700

In [56]:
a = dfpisa[dfpisa.Continent_Code == "EU"]["Math"]
a.isnull().sum()

0

In [57]:
b = dfpisa [dfpisa.Continent_Code == "AS"]["Math"]
b.isnull().sum()

0

In [51]:
n1 = len (dfpisa [dfpisa.Continent_Code == "EU"])
n1

37

In [52]:
n2 = len (dfpisa [dfpisa.Continent_Code == "AS"])
n2

17

In [58]:
ind_pisa = stats.ttest_ind (a,b)
ind_pisa

Ttest_indResult(statistic=0.8700553179679787, pvalue=0.38826888111307556)

In [59]:
t_pisa = ind_pisa.statistic
t_pisa

0.8700553179679787

In [60]:
df = n1 + n2 - 2 
df

52

In [61]:
pvalue_ = ind_pisa.pvalue
pvalue_

0.38826888111307556

In [63]:
alpha = 0.05   #Default
if p_value < alpha :
    print("Reject the null.")
else :
    print("Fail to reject the null")

Reject the null.

EXERCISE 4.The sample dataset has placement test scores (out of 100 points) for four subject areas: English, Reading, Math, and Writing. Students in the sample completed all 4 placement tests when they enrolled in the university. Suppose we are particularly interested in the English and Math sections, and want to determine whether students tended to score higher on their English or Math test, on average. We could use a paired t test to test if there was a significant difference in the average of the two tests.

In [65]:
dfsample = pd.read_excel ("students_2014.xlsx")
dfsample.head()

,ids,bday,enrolldate,expgradate,Rank,Major,Gender,Athlete,Height,Weight,...,English,Reading,Math,Writing,State,LiveOnCampus,HowCommute,CommuteTime,SleepTime,StudyTime
0,43783,1995-03-22,NaT,NaT,NaN,NaN,0.0,0,72.35,NaN,...,88.24,81.50,60.02,81.44,In state,1.0,NaN,NaN,7.0,1.0
1,20278,1995-01-01,NaT,NaT,NaN,Philosophy,0.0,0,70.66,179.20,...,89.45,85.25,70.19,73.27,NaN,1.0,NaN,NaN,5.0,2.0
2,20389,1994-12-31,NaT,NaT,NaN,NaN,0.0,0,70.68,198.52,...,96.73,86.88,71.20,84.24,In state,NaN,NaN,NaN,8.0,7.0
3,22820,1994-12-01,NaT,NaT,NaN,business administration,1.0,0,NaN,198.34,...,74.06,88.68,55.89,73.16,In state,1.0,NaN,NaN,2.0,6.0
4,24559,1994-11-10,NaT,NaT,NaN,NaN,1.0,1,67.43,128.17,...,82.61,77.30,65.52,80.45,Out of state,1.0,NaN,NaN,7.0,3.0

In [67]:
df_new = pd.DataFrame(dfsample.loc[:, ["English", "Math"]])
df_new

     English   Math
0      88.24  60.02
1      89.45  70.19
2      96.73  71.20
3      74.06  55.89
4      82.61  65.52
..       ...    ...
430    87.72  65.31
431    91.01  70.25
432    81.05  58.16
433    75.59  66.84
434    75.65  60.24

[435 rows x 2 columns]

In [68]:
df_dropEn = df_new.English.dropna()
df_dropEn

0      88.24
1      89.45
2      96.73
3      74.06
4      82.61
       ...
430    87.72
431    91.01
432    81.05
433    75.59
434    75.65
Name: English, Length: 409, dtype: float64

In [70]:
df_dropMt = df_new.Math.dropna()
df_dropMt

0      60.02
1      70.19
2      71.20
3      55.89
4      65.52
       ...
430    65.31
431    70.25
432    58.16
433    66.84
434    60.24
Name: Math, Length: 422, dtype: float64

In [72]:
dfsample.English.isnull().sum()

26

In [73]:
dfsample.Math.isnull().sum()

13

In [74]:
n1 = len(df_dropEn[df_dropEn.notnull()])
n1

409

In [75]:
n2 = len(df_dropMt[df_dropMt.notnull()])
n2

422

In [76]:
ind_sample = stats.ttest_ind(df_dropEn, df_dropMt)
ind_sample

Ttest_indResult(statistic=32.59188089176449, pvalue=1.2521075466222401e-150)

In [77]:
t = ind_sample.statistic
t

32.59188089176449

In [78]:
ind_sample.pvalue

1.2521075466222401e-150

In [79]:
df = n1 + n2 - 2
df

829

In [80]:
p_value = 2 * (1 - stats.t.cdf(t, df))
p_value

0.0

In [81]:
alpha = 0.05   #Default
if p_value < alpha :
    print("Reject the null.")
else :
    print("'Fail to reject the null.")

Reject the null.